foxval/esp-idf/components/soc/esp32c/include/soc/spi_reg.h
#define SPI_SLV_RDBUF_DLEN_REG(i)          (REG_SPI_BASE(i) + 0x04C)
/* SPI_SLV_RDBUF_DBITLEN : R/W ;bitpos:[23:0] ;default: 24'h0 ; */
/*description: In the slave mode it is the length in bits for read-buffer operations.
 The register value shall be (bit_num-1).*/
#define SPI_SLV_RDBUF_DBITLEN  0x00FFFFFF
#define SPI_SLV_RDBUF_DBITLEN_M  ((SPI_SLV_RDBUF_DBITLEN_V)<<(SPI_SLV_RDBUF_DBITLEN_S))
#define SPI_SLV_RDBUF_DBITLEN_V  0xFFFFFF
#define SPI_SLV_RDBUF_DBITLEN_S  0

#define SPI_SLV_RD_BIT_REG(i)          (REG_SPI_BASE(i) + 0x050)
/* SPI_SLV_RDATA_BIT : RW ;bitpos:[23:0] ;default: 24'b0 ; */
/*description: In the slave mode it is the bit length of read data. The value
 is the length - 1.*/
#define SPI_SLV_RDATA_BIT  0x00FFFFFF
#define SPI_SLV_RDATA_BIT_M  ((SPI_SLV_RDATA_BIT_V)<<(SPI_SLV_RDATA_BIT_S))
#define SPI_SLV_RDATA_BIT_V  0xFFFFFF
#define SPI_SLV_RDATA_BIT_S  0

#define SPI_FLASH_SUS_REG(i)          (REG_SPI_BASE(i) + 0x054)
/* SPI_FLASH_PES_COMMAND : R/W ;bitpos:[31:24] ;default: 8'h75 ; */
/*description: Program/Erase suspend command.*/
#define SPI_FLASH_PES_COMMAND  0x000000FF
#define SPI_FLASH_PES_COMMAND_M  ((SPI_FLASH_PES_COMMAND_V)<<(SPI_FLASH_PES_COMMAND_S))
#define SPI_FLASH_PES_COMMAND_V  0xFF
#define SPI_FLASH_PES_COMMAND_S  24
/* SPI_FLASH_PER_COMMAND : R/W ;bitpos:[23:16] ;default: 8'h7a ; */
/*description: Program/Erase resume command.*/
#define SPI_FLASH_PER_COMMAND  0x000000FF
#define SPI_FLASH_PER_COMMAND_M  ((SPI_FLASH_PER_COMMAND_V)<<(SPI_FLASH_PER_COMMAND_S))
#define SPI_FLASH_PER_COMMAND_V  0xFF
#define SPI_FLASH_PER_COMMAND_S  16
/* SPI_FLASH_TSUS : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: PES command is delayed tsus cycle based on apb clock.*/
#define SPI_FLASH_TSUS  0x0000FFFF
#define SPI_FLASH_TSUS_M  ((SPI_FLASH_TSUS_V)<<(SPI_FLASH_TSUS_S))
#define SPI_FLASH_TSUS_V  0xFFFF
#define SPI_FLASH_TSUS_S  0

#define SPI_TX_CRC_REG(i)          (REG_SPI_BASE(i) + 0x058)
/* SPI_TX_CRC_DATA : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: For SPI1  the value of crc32 for 256 bits data.*/
#define SPI_TX_CRC_DATA  0xFFFFFFFF
#define SPI_TX_CRC_DATA_M  ((SPI_TX_CRC_DATA_V)<<(SPI_TX_CRC_DATA_S))
#define SPI_TX_CRC_DATA_V  0xFFFFFFFF
#define SPI_TX_CRC_DATA_S  0

#define SPI_CACHE_FCTRL_REG(i)          (REG_SPI_BASE(i) + 0x05C)
/* SPI_CACHE_FLASH_PES_EN : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: For SPI0  spi1 send suspend command before cache read flash 
 1: enable  0:disable.*/
#define SPI_CACHE_FLASH_PES_EN  (BIT(3))
#define SPI_CACHE_FLASH_PES_EN_M  (BIT(3))
#define SPI_CACHE_FLASH_PES_EN_V  0x1
#define SPI_CACHE_FLASH_PES_EN_S  3
/* SPI_CACHE_FLASH_USR_CMD : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: For SPI0   cache  read flash for user define command  1: enable  0:disable.*/
#define SPI_CACHE_FLASH_USR_CMD  (BIT(2))
#define SPI_CACHE_FLASH_USR_CMD_M  (BIT(2))
#define SPI_CACHE_FLASH_USR_CMD_V  0x1
#define SPI_CACHE_FLASH_USR_CMD_S  2
/* SPI_CACHE_USR_CMD_4BYTE : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: For SPI0   cache  read flash with 4 bytes command  1: enable  0:disable.*/
#define SPI_CACHE_USR_CMD_4BYTE  (BIT(1))
#define SPI_CACHE_USR_CMD_4BYTE_M  (BIT(1))
#define SPI_CACHE_USR_CMD_4BYTE_V  0x1
#define SPI_CACHE_USR_CMD_4BYTE_S  1
/* SPI_CACHE_REQ_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: For SPI0  Cache access enable  1: enable  0:disable.*/
#define SPI_CACHE_REQ_EN  (BIT(0))
#define SPI_CACHE_REQ_EN_M  (BIT(0))
#define SPI_CACHE_REQ_EN_V  0x1
#define SPI_CACHE_REQ_EN_S  0

#define SPI_CACHE_SCTRL_REG(i)          (REG_SPI_BASE(i) + 0x060)
/* SPI_SMODE : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: 1: in ddr mode   0 in sdr mode*/
#define SPI_SMODE  (BIT(30))
#define SPI_SMODE_M  (BIT(30))
#define SPI_SMODE_V  0x1
#define SPI_SMODE_S  30
/* SPI_SRAM_WDUMMY_CYCLELEN : R/W ;bitpos:[29:22] ;default: 8'b1 ; */
/*description: For SPI0  In the sram mode  it is the length in bits of write
 dummy phase. The register value shall be (bit_num-1).*/
#define SPI_SRAM_WDUMMY_CYCLELEN  0x000000FF
#define SPI_SRAM_WDUMMY_CYCLELEN_M  ((SPI_SRAM_WDUMMY_CYCLELEN_V)<<(SPI_SRAM_WDUMMY_CYCLELEN_S))
#define SPI_SRAM_WDUMMY_CYCLELEN_V  0xFF
#define SPI_SRAM_WDUMMY_CYCLELEN_S  22
/* SPI_USR_SRAM_OCT : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: For SPI0  In the spi sram mode  spi octal I/O mode enable  1: enable  0:disable*/
#define SPI_USR_SRAM_OCT  (BIT(21))
#define SPI_USR_SRAM_OCT_M  (BIT(21))
#define SPI_USR_SRAM_OCT_V  0x1
#define SPI_USR_SRAM_OCT_S  21
/* SPI_CACHE_SRAM_USR_WCMD : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: For SPI0  In the spi sram mode cache write sram for user define command*/
#define SPI_CACHE_SRAM_USR_WCMD  (BIT(20))
#define SPI_CACHE_SRAM_USR_WCMD_M  (BIT(20))
#define SPI_CACHE_SRAM_USR_WCMD_V  0x1
#define SPI_CACHE_SRAM_USR_WCMD_S  20
/* SPI_SRAM_ADDR_BITLEN : R/W ;bitpos:[19:14] ;default: 6'd23 ; */
/*description: For SPI0  In the sram mode  it is the length in bits of address
 phase. The register value shall be (bit_num-1).*/
#define SPI_SRAM_ADDR_BITLEN  0x0000003F
#define SPI_SRAM_ADDR_BITLEN_M  ((SPI_SRAM_ADDR_BITLEN_V)<<(SPI_SRAM_ADDR_BITLEN_S))
#define SPI_SRAM_ADDR_BITLEN_V  0x3F
#define SPI_SRAM_ADDR_BITLEN_S  14
/* SPI_SRAM_RDUMMY_CYCLELEN : R/W ;bitpos:[13:6] ;default: 8'b1 ; */
/*description: For SPI0  In the sram mode  it is the length in bits of read
 dummy phase. The register value shall be (bit_num-1).*/
#define SPI_SRAM_RDUMMY_CYCLELEN  0x000000FF
#define SPI_SRAM_RDUMMY_CYCLELEN_M  ((SPI_SRAM_RDUMMY_CYCLELEN_V)<<(SPI_SRAM_RDUMMY_CYCLELEN_S))
#define SPI_SRAM_RDUMMY_CYCLELEN_V  0xFF
#define SPI_SRAM_RDUMMY_CYCLELEN_S  6
/* SPI_CACHE_SRAM_USR_RCMD : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: For SPI0  In the spi sram mode cache read sram for user define command.*/
#define SPI_CACHE_SRAM_USR_RCMD  (BIT(5))
#define SPI_CACHE_SRAM_USR_RCMD_M  (BIT(5))
#define SPI_CACHE_SRAM_USR_RCMD_V  0x1
#define SPI_CACHE_SRAM_USR_RCMD_S  5
/* SPI_USR_RD_SRAM_DUMMY : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: For SPI0  In the spi sram mode  it is the enable bit of dummy
 phase for read operations.*/
#define SPI_USR_RD_SRAM_DUMMY  (BIT(4))
#define SPI_USR_RD_SRAM_DUMMY_M  (BIT(4))
#define SPI_USR_RD_SRAM_DUMMY_V  0x1
#define SPI_USR_RD_SRAM_DUMMY_S  4
/* SPI_USR_WR_SRAM_DUMMY : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: For SPI0  In the spi sram mode  it is the enable bit of dummy
 phase for write operations.*/
#define SPI_USR_WR_SRAM_DUMMY  (BIT(3))
#define SPI_USR_WR_SRAM_DUMMY_M  (BIT(3))
#define SPI_USR_WR_SRAM_DUMMY_V  0x1
#define SPI_USR_WR_SRAM_DUMMY_S  3
/* SPI_USR_SRAM_QIO : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: For SPI0  In the spi sram mode  spi quad I/O mode enable  1: enable  0:disable*/
#define SPI_USR_SRAM_QIO  (BIT(2))
#define SPI_USR_SRAM_QIO_M  (BIT(2))
#define SPI_USR_SRAM_QIO_V  0x1
#define SPI_USR_SRAM_QIO_S  2
/* SPI_USR_SRAM_DIO : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: For SPI0  In the spi sram mode  spi dual I/O mode enable  1: enable  0:disable*/
#define SPI_USR_SRAM_DIO  (BIT(1))
#define SPI_USR_SRAM_DIO_M  (BIT(1))
#define SPI_USR_SRAM_DIO_V  0x1
#define SPI_USR_SRAM_DIO_S  1
/* SPI_CACHE_USR_SCMD_4BYTE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: For SPI0  In the spi sram mode  cache read flash with 4 bytes
 command  1: enable  0:disable.*/
#define SPI_CACHE_USR_SCMD_4BYTE  (BIT(0))
#define SPI_CACHE_USR_SCMD_4BYTE_M  (BIT(0))
#define SPI_CACHE_USR_SCMD_4BYTE_V  0x1
#define SPI_CACHE_USR_SCMD_4BYTE_S  0

#define SPI_SRAM_CMD_REG(i)          (REG_SPI_BASE(i) + 0x064)
/* SPI_SWB_MODE : R/W ;bitpos:[12:5] ;default: 8'b0 ; */
/*description: */
#define SPI_SWB_MODE  0x000000FF
#define SPI_SWB_MODE_M  ((SPI_SWB_MODE_V)<<(SPI_SWB_MODE_S))
#define SPI_SWB_MODE_V  0xFF
#define SPI_SWB_MODE_S  5
/* SPI_SRAM_RSTIO : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: For SPI0 SRAM IO mode reset enable. SRAM IO mode reset operation
 will be triggered when the bit is set. The bit will be cleared once the operation done*/
#define SPI_SRAM_RSTIO  (BIT(4))
#define SPI_SRAM_RSTIO_M  (BIT(4))
#define SPI_SRAM_RSTIO_V  0x1
#define SPI_SRAM_RSTIO_S  4
/* SPI_SRAM_QIO : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: For SPI0 SRAM QIO mode enable .  SRAM QIO enable command will
 be send when the bit is set. The bit will be cleared once the operation done.*/
#define SPI_SRAM_QIO  (BIT(1))
#define SPI_SRAM_QIO_M  (BIT(1))
#define SPI_SRAM_QIO_V  0x1
#define SPI_SRAM_QIO_S  1
/* SPI_SRAM_DIO : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: For SPI0 SRAM DIO mode enable .  SRAM DIO enable command will
 be send when the bit is set. The bit will be cleared once the operation done.*/
#define SPI_SRAM_DIO  (BIT(0))
#define SPI_SRAM_DIO_M  (BIT(0))
#define SPI_SRAM_DIO_V  0x1
#define SPI_SRAM_DIO_S  0

#define SPI_SRAM_DRD_CMD_REG(i)          (REG_SPI_BASE(i) + 0x068)
/* SPI_CACHE_SRAM_USR_RD_CMD_BITLEN : R/W ;bitpos:[31:28] ;default: 4'h0 ; */
/*description: For SPI0 When cache mode is enable it is the length in bits of
 command phase for SRAM. The register value shall be (bit_num-1).*/
#define SPI_CACHE_SRAM_USR_RD_CMD_BITLEN  0x0000000F
#define SPI_CACHE_SRAM_USR_RD_CMD_BITLEN_M  ((SPI_CACHE_SRAM_USR_RD_CMD_BITLEN_V)<<(SPI_CACHE_SRAM_USR_RD_CMD_BITLEN_S))
#define SPI_CACHE_SRAM_USR_RD_CMD_BITLEN_V  0xF
#define SPI_CACHE_SRAM_USR_RD_CMD_BITLEN_S  28
/* SPI_CACHE_SRAM_USR_RD_CMD_VALUE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: For SPI0 When cache mode is enable it is the read command value
 of command phase for SRAM.*/
#define SPI_CACHE_SRAM_USR_RD_CMD_VALUE  0x0000FFFF
#define SPI_CACHE_SRAM_USR_RD_CMD_VALUE_M  ((SPI_CACHE_SRAM_USR_RD_CMD_VALUE_V)<<(SPI_CACHE_SRAM_USR_RD_CMD_VALUE_S))
#define SPI_CACHE_SRAM_USR_RD_CMD_VALUE_V  0xFFFF
#define SPI_CACHE_SRAM_USR_RD_CMD_VALUE_S  0

#define SPI_SRAM_DWR_CMD_REG(i)          (REG_SPI_BASE(i) + 0x06C)
/* SPI_CACHE_SRAM_USR_WR_CMD_BITLEN : R/W ;bitpos:[31:28] ;default: 4'h0 ; */
/*description: For SPI0 When cache mode is enable it is the in bits of command
 phase  for SRAM. The register value shall be (bit_num-1).*/
#define SPI_CACHE_SRAM_USR_WR_CMD_BITLEN  0x0000000F
#define SPI_CACHE_SRAM_USR_WR_CMD_BITLEN_M  ((SPI_CACHE_SRAM_USR_WR_CMD_BITLEN_V)<<(SPI_CACHE_SRAM_USR_WR_CMD_BITLEN_S))
#define SPI_CACHE_SRAM_USR_WR_CMD_BITLEN_V  0xF
#define SPI_CACHE_SRAM_USR_WR_CMD_BITLEN_S  28
/* SPI_CACHE_SRAM_USR_WR_CMD_VALUE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: For SPI0 When cache mode is enable it is the write command value
 of command phase for SRAM.*/
#define SPI_CACHE_SRAM_USR_WR_CMD_VALUE  0x0000FFFF
#define SPI_CACHE_SRAM_USR_WR_CMD_VALUE_M  ((SPI_CACHE_SRAM_USR_WR_CMD_VALUE_V)<<(SPI_CACHE_SRAM_USR_WR_CMD_VALUE_S))
#define SPI_CACHE_SRAM_USR_WR_CMD_VALUE_V  0xFFFF
#define SPI_CACHE_SRAM_USR_WR_CMD_VALUE_S  0

#define SPI_SRAM_CLK_REG(i)          (REG_SPI_BASE(i) + 0x070)
/* SPI_SCLK_EQU_SYSCLK : R/W ;bitpos:[31] ;default: 1'b1 ; */
/*description: For SPI0 SRAM interface  1: spi_clk is eqaul to system 0: spi_clk
 is divided from system clock.*/
#define SPI_SCLK_EQU_SYSCLK  (BIT(31))
#define SPI_SCLK_EQU_SYSCLK_M  (BIT(31))
#define SPI_SCLK_EQU_SYSCLK_V  0x1
#define SPI_SCLK_EQU_SYSCLK_S  31
/* SPI_SCLKDIV_PRE : R/W ;bitpos:[30:18] ;default: 13'b0 ; */
/*description: For SPI0 SRAM interface  it is pre-divider of spi_clk.*/
#define SPI_SCLKDIV_PRE  0x00001FFF
#define SPI_SCLKDIV_PRE_M  ((SPI_SCLKDIV_PRE_V)<<(SPI_SCLKDIV_PRE_S))
#define SPI_SCLKDIV_PRE_V  0x1FFF
#define SPI_SCLKDIV_PRE_S  18
/* SPI_SCLKCNT_N : R/W ;bitpos:[17:12] ;default: 6'h3 ; */
/*description: For SPI0 SRAM interface  it is the divider of spi_clk. So spi_clk
 frequency is system/(spi_clkdiv_pre+1)/(spi_clkcnt_N+1)*/
#define SPI_SCLKCNT_N  0x0000003F
#define SPI_SCLKCNT_N_M  ((SPI_SCLKCNT_N_V)<<(SPI_SCLKCNT_N_S))
#define SPI_SCLKCNT_N_V  0x3F
#define SPI_SCLKCNT_N_S  12
/* SPI_SCLKCNT_H : R/W ;bitpos:[11:6] ;default: 6'h1 ; */
/*description: For SPI0 SRAM interface  it must be floor((spi_clkcnt_N+1)/2-1).
 In the slave mode it must be 0.*/
#define SPI_SCLKCNT_H  0x0000003F
#define SPI_SCLKCNT_H_M  ((SPI_SCLKCNT_H_V)<<(SPI_SCLKCNT_H_S))
#define SPI_SCLKCNT_H_V  0x3F
#define SPI_SCLKCNT_H_S  6
/* SPI_SCLKCNT_L : R/W ;bitpos:[5:0] ;default: 6'h3 ; */
/*description: For SPI0 SRAM interface  it must be equal to spi_clkcnt_N. In
 the slave mode it must be 0.*/
#define SPI_SCLKCNT_L  0x0000003F
#define SPI_SCLKCNT_L_M  ((SPI_SCLKCNT_L_V)<<(SPI_SCLKCNT_L_S))
#define SPI_SCLKCNT_L_V  0x3F
#define SPI_SCLKCNT_L_S  0

