foxval/esp-idf/components/soc/esp32c/include/soc/spi_reg.h
#define SPI_DIN_NUM_REG(i)          (REG_SPI_BASE(i) + 0x11C)
/* SPI_DINS_NUM : R/W ;bitpos:[26:24] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DINS_NUM  0x00000007
#define SPI_DINS_NUM_M  ((SPI_DINS_NUM_V)<<(SPI_DINS_NUM_S))
#define SPI_DINS_NUM_V  0x7
#define SPI_DINS_NUM_S  24
/* SPI_DIN7_NUM : R/W ;bitpos:[23:21] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DIN7_NUM  0x00000007
#define SPI_DIN7_NUM_M  ((SPI_DIN7_NUM_V)<<(SPI_DIN7_NUM_S))
#define SPI_DIN7_NUM_V  0x7
#define SPI_DIN7_NUM_S  21
/* SPI_DIN6_NUM : R/W ;bitpos:[20:18] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DIN6_NUM  0x00000007
#define SPI_DIN6_NUM_M  ((SPI_DIN6_NUM_V)<<(SPI_DIN6_NUM_S))
#define SPI_DIN6_NUM_V  0x7
#define SPI_DIN6_NUM_S  18
/* SPI_DIN5_NUM : R/W ;bitpos:[17:15] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DIN5_NUM  0x00000007
#define SPI_DIN5_NUM_M  ((SPI_DIN5_NUM_V)<<(SPI_DIN5_NUM_S))
#define SPI_DIN5_NUM_V  0x7
#define SPI_DIN5_NUM_S  15
/* SPI_DIN4_NUM : R/W ;bitpos:[14:12] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DIN4_NUM  0x00000007
#define SPI_DIN4_NUM_M  ((SPI_DIN4_NUM_V)<<(SPI_DIN4_NUM_S))
#define SPI_DIN4_NUM_V  0x7
#define SPI_DIN4_NUM_S  12
/* SPI_DIN3_NUM : R/W ;bitpos:[11:9] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DIN3_NUM  0x00000007
#define SPI_DIN3_NUM_M  ((SPI_DIN3_NUM_V)<<(SPI_DIN3_NUM_S))
#define SPI_DIN3_NUM_V  0x7
#define SPI_DIN3_NUM_S  9
/* SPI_DIN2_NUM : R/W ;bitpos:[8:6] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DIN2_NUM  0x00000007
#define SPI_DIN2_NUM_M  ((SPI_DIN2_NUM_V)<<(SPI_DIN2_NUM_S))
#define SPI_DIN2_NUM_V  0x7
#define SPI_DIN2_NUM_S  6
/* SPI_DIN1_NUM : R/W ;bitpos:[5:3] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DIN1_NUM  0x00000007
#define SPI_DIN1_NUM_M  ((SPI_DIN1_NUM_V)<<(SPI_DIN1_NUM_S))
#define SPI_DIN1_NUM_V  0x7
#define SPI_DIN1_NUM_S  3
/* SPI_DIN0_NUM : R/W ;bitpos:[2:0] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DIN0_NUM  0x00000007
#define SPI_DIN0_NUM_M  ((SPI_DIN0_NUM_V)<<(SPI_DIN0_NUM_S))
#define SPI_DIN0_NUM_V  0x7
#define SPI_DIN0_NUM_S  0

#define SPI_DOUT_MODE_REG(i)          (REG_SPI_BASE(i) + 0x120)
/* SPI_DOUTS_MODE : R/W ;bitpos:[17:16] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUTS_MODE  0x00000003
#define SPI_DOUTS_MODE_M  ((SPI_DOUTS_MODE_V)<<(SPI_DOUTS_MODE_S))
#define SPI_DOUTS_MODE_V  0x3
#define SPI_DOUTS_MODE_S  16
/* SPI_DOUT7_MODE : R/W ;bitpos:[15:14] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT7_MODE  0x00000003
#define SPI_DOUT7_MODE_M  ((SPI_DOUT7_MODE_V)<<(SPI_DOUT7_MODE_S))
#define SPI_DOUT7_MODE_V  0x3
#define SPI_DOUT7_MODE_S  14
/* SPI_DOUT6_MODE : R/W ;bitpos:[13:12] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT6_MODE  0x00000003
#define SPI_DOUT6_MODE_M  ((SPI_DOUT6_MODE_V)<<(SPI_DOUT6_MODE_S))
#define SPI_DOUT6_MODE_V  0x3
#define SPI_DOUT6_MODE_S  12
/* SPI_DOUT5_MODE : R/W ;bitpos:[11:10] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT5_MODE  0x00000003
#define SPI_DOUT5_MODE_M  ((SPI_DOUT5_MODE_V)<<(SPI_DOUT5_MODE_S))
#define SPI_DOUT5_MODE_V  0x3
#define SPI_DOUT5_MODE_S  10
/* SPI_DOUT4_MODE : R/W ;bitpos:[9:8] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT4_MODE  0x00000003
#define SPI_DOUT4_MODE_M  ((SPI_DOUT4_MODE_V)<<(SPI_DOUT4_MODE_S))
#define SPI_DOUT4_MODE_V  0x3
#define SPI_DOUT4_MODE_S  8
/* SPI_DOUT3_MODE : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT3_MODE  0x00000003
#define SPI_DOUT3_MODE_M  ((SPI_DOUT3_MODE_V)<<(SPI_DOUT3_MODE_S))
#define SPI_DOUT3_MODE_V  0x3
#define SPI_DOUT3_MODE_S  6
/* SPI_DOUT2_MODE : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT2_MODE  0x00000003
#define SPI_DOUT2_MODE_M  ((SPI_DOUT2_MODE_V)<<(SPI_DOUT2_MODE_S))
#define SPI_DOUT2_MODE_V  0x3
#define SPI_DOUT2_MODE_S  4
/* SPI_DOUT1_MODE : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT1_MODE  0x00000003
#define SPI_DOUT1_MODE_M  ((SPI_DOUT1_MODE_V)<<(SPI_DOUT1_MODE_S))
#define SPI_DOUT1_MODE_V  0x3
#define SPI_DOUT1_MODE_S  2
/* SPI_DOUT0_MODE : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT0_MODE  0x00000003
#define SPI_DOUT0_MODE_M  ((SPI_DOUT0_MODE_V)<<(SPI_DOUT0_MODE_S))
#define SPI_DOUT0_MODE_V  0x3
#define SPI_DOUT0_MODE_S  0

#define SPI_DOUT_NUM_REG(i)          (REG_SPI_BASE(i) + 0x124)
/* SPI_DOUTS_NUM : R/W ;bitpos:[26:24] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUTS_NUM  0x00000007
#define SPI_DOUTS_NUM_M  ((SPI_DOUTS_NUM_V)<<(SPI_DOUTS_NUM_S))
#define SPI_DOUTS_NUM_V  0x7
#define SPI_DOUTS_NUM_S  24
/* SPI_DOUT7_NUM : R/W ;bitpos:[23:21] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT7_NUM  0x00000007
#define SPI_DOUT7_NUM_M  ((SPI_DOUT7_NUM_V)<<(SPI_DOUT7_NUM_S))
#define SPI_DOUT7_NUM_V  0x7
#define SPI_DOUT7_NUM_S  21
/* SPI_DOUT6_NUM : R/W ;bitpos:[20:18] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT6_NUM  0x00000007
#define SPI_DOUT6_NUM_M  ((SPI_DOUT6_NUM_V)<<(SPI_DOUT6_NUM_S))
#define SPI_DOUT6_NUM_V  0x7
#define SPI_DOUT6_NUM_S  18
/* SPI_DOUT5_NUM : R/W ;bitpos:[17:15] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT5_NUM  0x00000007
#define SPI_DOUT5_NUM_M  ((SPI_DOUT5_NUM_V)<<(SPI_DOUT5_NUM_S))
#define SPI_DOUT5_NUM_V  0x7
#define SPI_DOUT5_NUM_S  15
/* SPI_DOUT4_NUM : R/W ;bitpos:[14:12] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT4_NUM  0x00000007
#define SPI_DOUT4_NUM_M  ((SPI_DOUT4_NUM_V)<<(SPI_DOUT4_NUM_S))
#define SPI_DOUT4_NUM_V  0x7
#define SPI_DOUT4_NUM_S  12
/* SPI_DOUT3_NUM : R/W ;bitpos:[11:9] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT3_NUM  0x00000007
#define SPI_DOUT3_NUM_M  ((SPI_DOUT3_NUM_V)<<(SPI_DOUT3_NUM_S))
#define SPI_DOUT3_NUM_V  0x7
#define SPI_DOUT3_NUM_S  9
/* SPI_DOUT2_NUM : R/W ;bitpos:[8:6] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT2_NUM  0x00000007
#define SPI_DOUT2_NUM_M  ((SPI_DOUT2_NUM_V)<<(SPI_DOUT2_NUM_S))
#define SPI_DOUT2_NUM_V  0x7
#define SPI_DOUT2_NUM_S  6
/* SPI_DOUT1_NUM : R/W ;bitpos:[5:3] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT1_NUM  0x00000007
#define SPI_DOUT1_NUM_M  ((SPI_DOUT1_NUM_V)<<(SPI_DOUT1_NUM_S))
#define SPI_DOUT1_NUM_V  0x7
#define SPI_DOUT1_NUM_S  3
/* SPI_DOUT0_NUM : R/W ;bitpos:[2:0] ;default: 2'h0 ; */
/*description: MOSI signals are delayed by system clock cycles*/
#define SPI_DOUT0_NUM  0x00000007
#define SPI_DOUT0_NUM_M  ((SPI_DOUT0_NUM_V)<<(SPI_DOUT0_NUM_S))
#define SPI_DOUT0_NUM_V  0x7
#define SPI_DOUT0_NUM_S  0

#define SPI_DATE_REG(i)          (REG_SPI_BASE(i) + 0x3FC)
/* SPI_DATE : RO ;bitpos:[27:0] ;default: 32'h1805070 ; */
/*description: SPI register version.*/
#define SPI_DATE  0x0FFFFFFF
#define SPI_DATE_M  ((SPI_DATE_V)<<(SPI_DATE_S))
#define SPI_DATE_V  0xFFFFFFF
#define SPI_DATE_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_SPI_REG_H_ */


